Revit 2027 API
ISingleServerService Interface
 The base interface class for all single-server services.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface ISingleServerService : IExternalService
Public Interface ISingleServerService
	Inherits IExternalService
public interface class ISingleServerService : IExternalService
type ISingleServerService =
    interface
        interface IExternalService
    end
The ISingleServerService type exposes the following members.
Methods
Name | Description
Execute |  Implement this method to execute the given server.
(Inherited from IExternalService)
GetDescription |  Implement this method to return a description of the service.
(Inherited from IExternalService)
GetName |  Implement this method to return the name of the service.
(Inherited from IExternalService)
GetServiceId |  Implement this method to return the unique Id of the service.
(Inherited from IExternalService)
GetVendorId |  Implement this method to return the vendor Id of the service.
(Inherited from IExternalService)
IsValidServer |  Implement this method to check if the given instance represents a valid server of this service.
(Inherited from IExternalService)
OnServersChanged |  Implement this method to handle situations when servers for the service have changed.
(Inherited from IExternalService)
OnServersDisparity |  Implements this method to get notified that the servers in a just opened document differ from those currently set as active for the service.
(Inherited from IExternalService)
Top
Remarks
 Both single-server and multi-server services may have more than one server registered for them. The difference between these two kinds is while there can only be one active server at any given time for a single-sever service, there may be a set of active servers assigned for a multi-server service.
 ISingleServerService does not have any specific methods (currently) added to those inherited from the common IExternalService interface.
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace